espressif/esp-idf/components/soc/soc/esp32s2/include/soc/i2s_struct.h
            uint32_t n_err_seg:        3;                 /*don't use*/
            uint32_t shift_rate:       3;                 /*don't use*/
            uint32_t max_slide_sample: 8;                 /*don't use*/
            uint32_t pack_len_8k:      5;                 /*don't use*/
            uint32_t n_min_err:        3;                 /*don't use*/
            uint32_t reserved28:       4;                 /*don't use*/
        };
        uint32_t val;
    } plc_conf0;
    union {
        struct {
            uint32_t bad_cef_atten_para:       8;         /*don't use*/
            uint32_t bad_cef_atten_para_shift: 4;         /*don't use*/
            uint32_t bad_ola_win2_para_shift:  4;         /*don't use*/
            uint32_t bad_ola_win2_para:        8;         /*don't use*/
            uint32_t slide_win_len:            8;         /*don't use*/
        };
        uint32_t val;
    } plc_conf1;
    union {
        struct {
            uint32_t cvsd_seg_mod: 2;                     /*don't use*/
            uint32_t min_period:   5;                     /*don't use*/
            uint32_t reserved7:   25;                     /*don't use*/
        };
        uint32_t val;
    } plc_conf2;
    union {
        struct {
            uint32_t en:                     1;           /*don't use*/
            uint32_t chan_mod:               1;           /*don't use*/
            uint32_t cvsd_dec_pack_err:      1;           /*don't use*/
            uint32_t cvsd_pack_len_8k:       5;           /*don't use*/
            uint32_t cvsd_inf_en:            1;           /*don't use*/
            uint32_t cvsd_dec_start:         1;           /*don't use*/
            uint32_t cvsd_dec_reset:         1;           /*don't use*/
            uint32_t plc_en:                 1;           /*don't use*/
            uint32_t plc2dma_en:             1;           /*don't use*/
            uint32_t reserved13:            19;           /*don't use*/
        };
        uint32_t val;
    } esco_conf0;
    union {
        struct {
            uint32_t with_en:        1;                   /*don't use*/
            uint32_t no_en:          1;                   /*don't use*/
            uint32_t cvsd_enc_start: 1;                   /*don't use*/
            uint32_t cvsd_enc_reset: 1;                   /*don't use*/
            uint32_t reserved4:     28;                   /*don't use*/
        };
        uint32_t val;
    } sco_conf0;
    union {
        struct {
            uint32_t tx_pcm_conf:    3;                   /*Compress/Decompress module configuration bits. 0: decompress transmitted data  1:compress transmitted data*/
            uint32_t tx_pcm_bypass:  1;                   /*Set this bit to bypass  Compress/Decompress module for transmitted data.*/
            uint32_t rx_pcm_conf:    3;                   /*Compress/Decompress module configuration bits. 0: decompress received data  1:compress received data*/
            uint32_t rx_pcm_bypass:  1;                   /*Set this bit to bypass Compress/Decompress module for received data.*/
            uint32_t tx_stop_en:     1;                   /*Set this bit to stop disable output BCK signal and WS signal when tx FIFO is emtpy*/
            uint32_t tx_zeros_rm_en: 1;                   /*don't use*/
            uint32_t reserved10:    22;
        };
        uint32_t val;
    } conf1;
    union {
        struct {
            uint32_t fifo_force_pd:    1;                 /*Force FIFO power-down*/
            uint32_t fifo_force_pu:    1;                 /*Force FIFO power-up*/
            uint32_t plc_mem_force_pd: 1;
            uint32_t plc_mem_force_pu: 1;
            uint32_t reserved4:       28;
        };
        uint32_t val;
    } pd_conf;
    union {
        struct {
            uint32_t camera_en:             1;            /*Set this bit to enable camera mode*/
            uint32_t lcd_tx_wrx2_en:        1;            /*LCD WR double for one datum.*/
            uint32_t lcd_tx_sdx2_en:        1;            /*Set this bit to duplicate data pairs (Frame Form 2) in LCD mode.*/
            uint32_t data_enable_test_en:   1;            /*for debug camera mode enable*/
            uint32_t data_enable:           1;            /*for debug camera mode enable*/
            uint32_t lcd_en:                1;            /*Set this bit to enable LCD mode*/
            uint32_t ext_adc_start_en:      1;            /*Set this bit to enable the function that ADC mode is triggered by external signal.*/
            uint32_t inter_valid_en:        1;            /*Set this bit to enable camera internal valid*/
            uint32_t cam_sync_fifo_reset:   1;            /*Set this bit to reset cam_sync_fifo*/
            uint32_t cam_clk_loopback:      1;            /*Set this bit to loopback cam_clk from i2s_rx*/
            uint32_t i_v_sync_filter_en:    1;
            uint32_t i_v_sync_filter_thres: 3;
            uint32_t reserved14:           18;
        };
        uint32_t val;
    } conf2;
    union {
        struct {
            uint32_t clkm_div_num: 8;                     /*Integral I2S clock divider value*/
            uint32_t clkm_div_b:   6;                     /*Fractional clock divider numerator value*/
            uint32_t clkm_div_a:   6;                     /*Fractional clock divider denominator value*/
            uint32_t clk_en:       1;                     /*Set this bit to enable clk gate*/
            uint32_t clk_sel:      2;                     /*Set this bit to enable clk_apll*/
            uint32_t reserved23:   9;
        };
        uint32_t val;
    } clkm_conf;
    union {
        struct {
            uint32_t tx_bck_div_num: 6;                   /*Bit clock configuration bits in transmitter mode.*/
            uint32_t rx_bck_div_num: 6;                   /*Bit clock configuration bits in receiver mode.*/
            uint32_t tx_bits_mod:    6;                   /*Set the bits to configure bit length of I2S transmitter channel.*/
            uint32_t rx_bits_mod:    6;                   /*Set the bits to configure bit length of I2S receiver channel.*/
            uint32_t reserved24:     8;
        };
        uint32_t val;
    } sample_rate_conf;
    union {
        struct {
            uint32_t tx_pdm_en:                  1;       /*Set this bit to enable transmitter PDM mode*/
            uint32_t rx_pdm_en:                  1;       /*Set this bit to enable receiver PDM mode*/
            uint32_t pcm2pdm_conv_en:            1;       /*Set this bit to enable PCM-to-PDM converter*/
            uint32_t pdm2pcm_conv_en:            1;       /*Set this bit to enable PDM-to-PCM converter*/
            uint32_t tx_sinc_osr2:               4;       /*upsample rate = 64 * reg_tx_pdm_sinc_osr2*/
            uint32_t tx_prescale:                8;       /*set to 0*/
            uint32_t tx_hp_in_shift:             2;       /*Adjust size of input signal to filter module. 0: divided by 2  1:multiplied by 1  2:multiplied by 2  3:multiplied by 4*/
            uint32_t tx_lp_in_shift:             2;       /*Adjust size of input signal to filter module. 0: divided by 2  1:multiplied by 1  2:multiplied by 2  3:multiplied by 4*/
            uint32_t tx_sinc_in_shift:           2;       /*Adjust size of input signal to filter module. 0: divided by 2  1:multiplied by 1  2:multiplied by 2  3:multiplied by 4*/
            uint32_t tx_sigmadelta_in_shift:     2;       /*Adjust size of input signal to filter module. 0: divided by 2  1:multiplied by 1  2:multiplied by 2  3:multiplied by 4*/
            uint32_t rx_sinc_dsr_16_en:          1;       /*PDM down-sampling rate for filter group1 in receiver mode. 0: downsample rate = 64  1:downsample rate = 128*/
            uint32_t txhp_bypass:                1;       /*Set this bit to enable tx pdm hp filter bypass*/
            uint32_t tx_chan_mod:                2;       /*pdm tx channel mode*/
            uint32_t tx_way_mode:                2;       /*0/1 pdm rx use one-way*/
            uint32_t rx_way_mode:                2;       /*0/1 pdm rx use one-way*/
        };
        uint32_t val;
    } pdm_conf;
    union {
        struct {
            uint32_t tx_pdm_fs: 10;                       /*PCM-to-PDM converter PCM frequency parameter*/
            uint32_t tx_pdm_fp: 10;                       /*PCM-to-PDM converter PDM frequency parameter*/
            uint32_t reserved20:12;
        };
        uint32_t val;
    } pdm_freq_conf;
    union {
        struct {
            uint32_t tx_idle:    1;                       /*1: i2s_tx is idle state*/
            uint32_t reserved1: 31;
        };
        uint32_t val;
    } state;
    uint32_t reserved_c0;
    uint32_t reserved_c4;
    uint32_t reserved_c8;
    uint32_t reserved_cc;
    uint32_t reserved_d0;
    uint32_t reserved_d4;
    uint32_t reserved_d8;
    uint32_t reserved_dc;
    uint32_t reserved_e0;
    uint32_t reserved_e4;
    uint32_t reserved_e8;
    uint32_t reserved_ec;
    uint32_t reserved_f0;
    uint32_t reserved_f4;
    uint32_t reserved_f8;
    uint32_t date;                                        /**/
} i2s_dev_t;
extern i2s_dev_t I2S0;
extern i2s_dev_t I2S1;
#ifdef __cplusplus
}
#endif

#endif  /* _SOC_I2S_STRUCT_H_ */
